app/Controllers/AdminController.php

SELECT SUM(`stock_kg`) AS `stock_kg`
FROM `rice_inventory`
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `users`
---
        }

        $inventoryModel = new RiceInventoryModel();
        $totalStockResult = $inventoryModel->selectSum('stock_kg')->first();
        $totalStock = $totalStockResult['stock_kg'] ?? 0;

        $userModel = new UserModel();
        $totalUsers = $userModel->countAll();

SELECT *
FROM `rice_inventory`
WHERE `stock_kg` > 0
---
    public function salesIndex() {
        $inventoryModel = new RiceInventoryModel();
        $salesModel = new SalesTransactionModel();

        // Get only items that have stock for the dropdown
        $data['inventory'] = $inventoryModel->where('stock_kg >', 0)->findAll();