app/Controllers/AdminController.php

SELECT *
FROM `users`
---
    public function userList() {
        $model = new UserModel();
        $data['users'] = $model->findAll();

SELECT *
FROM `users`
---
    public function userDelete($id) {
        $model = new UserModel();
        $model->delete($id);
        return redirect()->to('/users')->with('status', 'User Deleted Successfully');

SELECT *
FROM `rice_inventory`
---
    public function inventoryIndex() {
        $model = new RiceInventoryModel();
        $data['inventory'] = $model->findAll();

INSERT INTO `rice_inventory` (`variety`, `grade`, `stock_kg`, `price`, `status`) VALUES ('Red Rice', 'Well-Milled', '78', '70', 'In Stock')
---
    public function inventoryStore() {
        $model = new RiceInventoryModel();
        $stock = $this->request->getVar('stock_kg');

        // Automatic Status Determination
        $status = 'In Stock';
        if ($stock <= 0) {
            $status = 'Out of Stock';
        } elseif ($stock <= 10) {
            $status = 'Low Stock';
        }

        $data = [
            'variety'  => $this->request->getVar('variety'),
            'grade'    => $this->request->getVar('grade'),
            'stock_kg' => $stock,
            'price'    => $this->request->getVar('price'),
            'status'   => $status
        ];

        $model->save($data);

SELECT *
FROM `rice_inventory`
WHERE `rice_inventory`.`id` = '3'
---
    public function inventoryEdit($id) {
        $model = new RiceInventoryModel();
        $data['item'] = $model->find($id);

SELECT *
FROM `rice_inventory`
---
    public function inventoryUpdate($id) {
        $model = new RiceInventoryModel();
        $stock = $this->request->getVar('stock_kg');

        // Automatic Status Determination
        $status = 'In Stock';
        if ($stock <= 0) {
            $status = 'Out of Stock';
        } elseif ($stock <= 10) {
            $status = 'Low Stock';
        }

        $data = [
            'variety'  => $this->request->getVar('variety'),
            'grade'    => $this->request->getVar('grade'),
            'stock_kg' => $stock,
            'price'    => $this->request->getVar('price'),
            'status'   => $status
        ];

        $model->update($id, $data);
        return redirect()->to('/inventory')->with('status', 'Inventory Updated Successfully');

SELECT *
FROM `rice_inventory`
WHERE `stock_kg` > 0
---
    public function salesIndex() {
        $inventoryModel = new RiceInventoryModel();
        $salesModel = new SalesTransactionModel();

        // Get only items that have stock for the dropdown
        $data['inventory'] = $inventoryModel->where('stock_kg >', 0)->findAll();

SELECT *
FROM `rice_inventory`
WHERE `rice_inventory`.`id` = '5'
---
    public function addToCart() {
        $inventoryModel = new RiceInventoryModel();
        $variety_id = $this->request->getPost('variety_id');
        $qty = $this->request->getPost('quantity');
        $unit = $this->request->getPost('unit');
        $customer_name = $this->request->getPost('customer_name') ?: 'Walk-in Customer';

        $qty_sold = ($unit === 'sack') ? $qty * 50 : $qty;

        $rice = $inventoryModel->find($variety_id);

SELECT *
FROM `rice_inventory`
WHERE `rice_inventory`.`id` = '3'
---
    public function salesStore() {
        $salesModel = new SalesTransactionModel();
        $inventoryModel = new RiceInventoryModel();

        $cart = session()->get('cart') ?? [];

        if (empty($cart)) {
            // Fallback for single sale if form submitted directly without cart (optional)
            $variety_id = $this->request->getVar('variety_id');
            if ($variety_id) {
                $qty = $this->request->getVar('quantity');
                $unit = $this->request->getVar('unit');
                $qty_sold = ($unit === 'sack') ? $qty * 50 : $qty;
                $customer_name = $this->request->getVar('customer_name') ?: 'Walk-in Customer';

                $rice = $inventoryModel->find($variety_id);

SELECT *
FROM `rice_inventory`
WHERE `rice_inventory`.`id` = '3'
---
        $db->transStart();

        foreach ($cart as $item) {
            $rice = $inventoryModel->find($item['variety_id']);

UPDATE `rice_inventory` SET `stock_kg` = 46, `status` = 'In Stock'
WHERE `rice_inventory`.`id` IN ('3')
---

            $new_stock = $rice['stock_kg'] - $item['quantity_kg'];
            $status = ($new_stock <= 0) ? 'Out of Stock' : (($new_stock <= 10) ? 'Low Stock' : 'In Stock');
            $inventoryModel->update($item['variety_id'], ['stock_kg' => $new_stock, 'status' => $status]);