app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin1234@gmail.com'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $model->where('email', $email)->first();