app/Models/SalesTransactionModel.php

    public function getSalesHistory()
    {
        return $this->select('sales_transactions.reference_no, sales_transactions.customer_name, sales_transactions.transaction_date, SUM(sales_transactions.total_price) as total_amount, sales_transactions.cash_received, sales_transactions.change_amount, GROUP_CONCAT(CONCAT(rice_inventory.variety, " (", rice_inventory.grade, ")") SEPARATOR ", ") as items_summary, SUM(sales_transactions.quantity_kg) as total_qty')
                    ->join('rice_inventory', 'rice_inventory.id = sales_transactions.variety_id', 'left')
                    ->groupBy('sales_transactions.reference_no')
                    ->orderBy('transaction_date', 'DESC')
                    ->findAll();
---
SELECT `sales_transactions`.`reference_no`, `sales_transactions`.`customer_name`, `sales_transactions`.`transaction_date`, SUM(sales_transactions.total_price) as total_amount, `sales_transactions`.`cash_received`, `sales_transactions`.`change_amount`, GROUP_CONCAT(CONCAT(rice_inventory.variety, " (", `rice_inventory`.`grade`, ")") SEPARATOR ", ") as items_summary, SUM(sales_transactions.quantity_kg) as total_qty
FROM `sales_transactions`
LEFT JOIN `rice_inventory` ON `rice_inventory`.`id` = `sales_transactions`.`variety_id`
GROUP BY `sales_transactions`.`reference_no`
ORDER BY `transaction_date` DESC

    public function getWeeklySales()
    {
        return $this->select("DATE(transaction_date) as date, SUM(total_price) as total")
                    ->groupBy("DATE(transaction_date)")
                    ->where('transaction_date >=', date('Y-m-d', strtotime('-6 days')))
                    ->orderBy('date', 'ASC')
                    ->findAll();
---
SELECT DATE(transaction_date) as date, SUM(total_price) as total
FROM `sales_transactions`
WHERE `transaction_date` >= '2026-05-09'
GROUP BY DATE(transaction_date)
ORDER BY `date` ASC

    public function getSalesByVariety()
    {
        return $this->select('rice_inventory.variety, SUM(sales_transactions.total_price) as total')
                    ->join('rice_inventory', 'rice_inventory.id = sales_transactions.variety_id')
                    ->groupBy('rice_inventory.variety')
                    ->findAll();
---
SELECT `rice_inventory`.`variety`, SUM(sales_transactions.total_price) as total
FROM `sales_transactions`
JOIN `rice_inventory` ON `rice_inventory`.`id` = `sales_transactions`.`variety_id`
GROUP BY `rice_inventory`.`variety`

    public function getTransactionByReference($ref)
    {
        return $this->select('sales_transactions.*, rice_inventory.variety, rice_inventory.grade, rice_inventory.price as unit_price')
                    ->join('rice_inventory', 'rice_inventory.id = sales_transactions.variety_id')
                    ->where('sales_transactions.reference_no', $ref)
                    ->findAll();
---
SELECT `sales_transactions`.*, `rice_inventory`.`variety`, `rice_inventory`.`grade`, `rice_inventory`.`price` as `unit_price`
FROM `sales_transactions`
JOIN `rice_inventory` ON `rice_inventory`.`id` = `sales_transactions`.`variety_id`
WHERE `sales_transactions`.`reference_no` = 'TRX-E83B4D99'